Revit 2027 API
FamilyParameterSet.Erase Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual int Erase(
	FamilyParameter item
)
Public Overridable Function Erase (
	item As FamilyParameter
) As Integer
public:
virtual int Erase(
	FamilyParameter^ item
)
abstract Erase :
        item : FamilyParameter -> int
override Erase :
        item : FamilyParameter -> int
Parameters
item FamilyParameter
Return Value
Int32
See Also
Reference
FamilyParameterSet Class
Autodesk.Revit.DB Namespace